Revit 2026 API

# DocumentExport(String, IListElementId, PDFExportOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Export(
	string folder,
	IList<ElementId> viewIds,
	PDFExportOptions options
)
```
```vb
Public Function Export (
	folder As String,
	viewIds As IList(Of ElementId),
	options As PDFExportOptions
) As Boolean
```
```cpp
public:
bool Export(
	String^ folder,
	IList<ElementId^>^ viewIds,
	PDFExportOptions^ options
)
```
```fsharp
member Export :
        folder : string *
        viewIds : IList<ElementId> *
        options : PDFExportOptions -> bool
```

#### Parameters

folder String

viewIds IListElementId

options PDFExportOptions

#### Return Value

Boolean

#### Reference

Document Class

Export Overload

Autodesk.Revit.DB Namespace